In [443]:
import numpy as np
import pandas as pd

In [444]:
indexes = ['Iran','b','c']
list_py = [10,20,30]
dic = {'a':10 , 'b':20 , 'c':30}

In [445]:
sample = pd.Series(list_py,indexes)

In [446]:
sample

Iran    10
b       20
c       30
dtype: int64

In [447]:
covid19_data = pd.Series(data = [2000,400,1220,587,54789], index = ['Iran' , 'Usa' , 'India' , 'China' , 'France'])

In [448]:
covid19_data * 2

Iran        4000
Usa          800
India       2440
China       1174
France    109578
dtype: int64

In [449]:
covid19_data + sample

China        NaN
France       NaN
India        NaN
Iran      2010.0
Usa          NaN
b            NaN
c            NaN
dtype: float64

In [450]:
columns = ['Q','W','E','R','T']

In [451]:
index = ['A','B','C','D']

In [452]:
data = np.random.randint(-100 , 100 ,  (4,5))

In [453]:
data

array([[-52,  34, -97,  86, -90],
       [-51,  25,  17, -63,  42],
       [-70,  59,  -4,  99,  37],
       [ 60, -77, -60,   3,  47]])

In [454]:
df = pd.DataFrame(data,index,columns)

In [455]:
df

    Q   W   E   R   T
A -52  34 -97  86 -90
B -51  25  17 -63  42
C -70  59  -4  99  37
D  60 -77 -60   3  47

In [456]:
type(df)

pandas.core.frame.DataFrame

In [457]:
df['W']

A    34
B    25
C    59
D   -77
Name: W, dtype: int32

In [458]:
type(df['Q'])

pandas.core.series.Series

In [459]:
df['new columns'] = df['Q'] + df["W"]

In [460]:
df

    Q   W   E   R   T  new columns
A -52  34 -97  86 -90          -18
B -51  25  17 -63  42          -26
C -70  59  -4  99  37          -11
D  60 -77 -60   3  47          -17

In [461]:
df.drop('Q', axis = 1)

    W   E   R   T  new columns
A  34 -97  86 -90          -18
B  25  17 -63  42          -26
C  59  -4  99  37          -11
D -77 -60   3  47          -17

In [462]:
df

    Q   W   E   R   T  new columns
A -52  34 -97  86 -90          -18
B -51  25  17 -63  42          -26
C -70  59  -4  99  37          -11
D  60 -77 -60   3  47          -17

In [463]:
df = df.drop('Q',axis=1)

In [464]:
df

    W   E   R   T  new columns
A  34 -97  86 -90          -18
B  25  17 -63  42          -26
C  59  -4  99  37          -11
D -77 -60   3  47          -17

In [465]:
df.loc['A']

W              34
E             -97
R              86
T             -90
new columns   -18
Name: A, dtype: int32

In [466]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [467]:
df.loc[["A","B"]]

    W   E   R   T  new columns
A  34 -97  86 -90          -18
B  25  17 -63  42          -26

In [468]:
df_new = df.drop('A')

In [469]:
df_new

    W   E   R   T  new columns
B  25  17 -63  42          -26
C  59  -4  99  37          -11
D -77 -60   3  47          -17

In [470]:
df.iloc[0:2,2:]

    R   T  new columns
A  86 -90          -18
B -63  42          -26

In [471]:
df.loc[['A','B'],['W','new columns']]

    W  new columns
A  34          -18
B  25          -26

In [472]:
df.iloc[-1:,-1:]

   new columns
D          -17

In [473]:
df.iloc[-1:]

    W   E  R   T  new columns
D -77 -60  3  47          -17

In [474]:
df

    W   E   R   T  new columns
A  34 -97  86 -90          -18
B  25  17 -63  42          -26
C  59  -4  99  37          -11
D -77 -60   3  47          -17

In [475]:
df >= 0

       W      E      R      T  new columns
A   True  False   True  False        False
B   True   True  False   True        False
C   True  False   True   True        False
D  False  False   True   True        False

In [476]:
df[df >= 0]

      W     E     R     T  new columns
A  34.0   NaN  86.0   NaN          NaN
B  25.0  17.0   NaN  42.0          NaN
C  59.0   NaN  99.0  37.0          NaN
D   NaN   NaN   3.0  47.0          NaN

In [477]:
df[df['W'] > 0].iloc[:1]

    W   E   R   T  new columns
A  34 -97  86 -90          -18

In [478]:
df.columns

Index(['W', 'E', 'R', 'T', 'new columns'], dtype='object')

In [479]:
df[(df['W'] > 1) & (df['new columns'] >= 0)]

Empty DataFrame
Columns: [W, E, R, T, new columns]
Index: []

In [480]:
df.reset_index()

  index   W   E   R   T  new columns
0     A  34 -97  86 -90          -18
1     B  25  17 -63  42          -26
2     C  59  -4  99  37          -11
3     D -77 -60   3  47          -17

In [481]:
index_states = ['Bastam', 'Shahrood', 'Bonab', 'Tabriz']

In [482]:
df['States'] = index_states

In [483]:
df = df.set_index('States')

In [484]:
df

           W   E   R   T  new columns
States
Bastam    34 -97  86 -90          -18
Shahrood  25  17 -63  42          -26
Bonab     59  -4  99  37          -11
Tabriz   -77 -60   3  47          -17

In [485]:
df.describe()

               W         E          R          T  new columns
count   4.000000   4.00000   4.000000   4.000000     4.000000
mean   10.250000 -36.00000  31.250000   9.000000   -18.000000
std    59.918695  52.05766  75.869955  66.126142     6.164414
min   -77.000000 -97.00000 -63.000000 -90.000000   -26.000000
25%    -0.500000 -69.25000 -13.500000   5.250000   -20.000000
50%    29.500000 -32.00000  44.500000  39.500000   -17.500000
75%    40.250000   1.25000  89.250000  43.250000   -15.500000
max    59.000000  17.00000  99.000000  47.000000   -11.000000

In [486]:
df.dtypes

W              int32
E              int32
R              int32
T              int32
new columns    int32
dtype: object

In [487]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bastam to Tabriz
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   W            4 non-null      int32
 1   E            4 non-null      int32
 2   R            4 non-null      int32
 3   T            4 non-null      int32
 4   new columns  4 non-null      int32
dtypes: int32(5)
memory usage: 112.0+ bytes

In [488]:
df

           W   E   R   T  new columns
States
Bastam    34 -97  86 -90          -18
Shahrood  25  17 -63  42          -26
Bonab     59  -4  99  37          -11
Tabriz   -77 -60   3  47          -17

In [489]:
df['E'][2] = np.nan
df['E'][3] = np.nan
df['W'][0] = np.nan
df['W'][1] = np.nan
df['W'][2] = np.nan

C:\Users\Yasin\AppData\Local\Temp\ipykernel_4332\1910374095.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['W'][0] = np.nan

In [490]:
df

             W     E   R   T  new columns
States
Bastam     NaN -97.0  86 -90          -18
Shahrood   NaN  17.0 -63  42          -26
Bonab      NaN   NaN  99  37          -11
Tabriz   -77.0   NaN   3  47          -17

In [491]:
# axis = 1 means delete column 
# thresh means at least valid data in any coulmn need to not delete
df.dropna(axis=1, thresh = 2)

             E   R   T  new columns
States
Bastam   -97.0  86 -90          -18
Shahrood  17.0 -63  42          -26
Bonab      NaN  99  37          -11
Tabriz     NaN   3  47          -17

In [492]:
df.fillna(value = 'unavailable')

                    W            E   R   T  new columns
States
Bastam    unavailable        -97.0  86 -90          -18
Shahrood  unavailable         17.0 -63  42          -26
Bonab     unavailable  unavailable  99  37          -11
Tabriz          -77.0  unavailable   3  47          -17

In [493]:
df['E'] = df['E'].fillna(value=df['E'].mean())

In [494]:
df

             W     E   R   T  new columns
States
Bastam     NaN -97.0  86 -90          -18
Shahrood   NaN  17.0 -63  42          -26
Bonab      NaN -40.0  99  37          -11
Tabriz   -77.0 -40.0   3  47          -17

In [495]:
df['W'] = df['W'].fillna(value = 0 )

In [496]:
df

             W     E   R   T  new columns
States
Bastam     0.0 -97.0  86 -90          -18
Shahrood   0.0  17.0 -63  42          -26
Bonab      0.0 -40.0  99  37          -11
Tabriz   -77.0 -40.0   3  47          -17

In [648]:
df_csv = pd.read_csv('\\py practice\\Exercise Notebooks\\Data\\Universities.csv')

In [649]:
df_csv.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [499]:
df_csv.groupby('Year').sum().sort_index(ascending=False)

,Sector,University,Completions,Geography
Year,,,,
2016,"Private for-profit, 2-yearPrivate for-profit, ...",Pima Medical Institute-Las VegasHealthcare Pre...,26224,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2015,"Private for-profit, 2-yearPrivate not-for-prof...",Pima Medical Institute-Las VegasRoseman Univer...,26279,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2014,"Private not-for-profit, 4-year or abovePrivate...",Roseman University of Health SciencesExpertise...,24730,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2013,"Private for-profit, 2-yearPrivate for-profit, ...",Aviation Institute of Maintenance-Las VegasDeV...,21046,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...
2012,"Private for-profit, less-than 2-yearPrivate fo...",Academy of Hair Design-Las VegasCareer College...,20333,NevadaNevadaNevadaNevadaNevadaNevadaNevadaNeva...

In [500]:
df_csv.groupby(['Year','University']).sum().sort_index(ascending=False).transpose()

Year                                            2016                           \
University     Wongu University of Oriental Medicine   Western Nevada College
Sector       Private not-for-profit, 4-year or above  Public, 4-year or above
Completions                                        0                      960
Geography                                     Nevada                   Nevada

Year                                               \
University  Utah College of Massage Therapy-Vegas
Sector       Private for-profit, less-than 2-year
Completions                                   240
Geography                                  Nevada

Year                                                                        \
University          University of Phoenix-Nevada University of Nevada-Reno
Sector       Private for-profit, 4-year or above   Public, 4-year or above
Completions                                  423                      4309
Geography                                 Nevada                    Nevada

Year                                                                          \
University  University of Nevada-Las Vegas Truckee Meadows Community College
Sector             Public, 4-year or above                    Public, 2-year
Completions                           5367                              2431
Geography                           Nevada                            Nevada

Year                                                  \
University                   Touro University Nevada
Sector       Private not-for-profit, 4-year or above
Completions                                      356
Geography                                     Nevada

Year                                              \
University        The Art Institute of Las Vegas
Sector       Private for-profit, 4-year or above
Completions                                  135
Geography                                 Nevada

Year                                                  ...  \
University                     Sierra Nevada College  ...
Sector       Private not-for-profit, 4-year or above  ...
Completions                                      261  ...
Geography                                     Nevada  ...

Year                                                          2012  \
University  Euphoria Institute of Beauty Arts & Sciences-Summerlin
Sector                              Private for-profit, 2-year
Completions                                                113
Geography                                               Nevada

Year                                                                   \
University  Euphoria Institute of Beauty Arts & Sciences-Green Valley
Sector                              Private for-profit, 2-year
Completions                                                153
Geography                                               Nevada

Year                                                                \
University  College of Southern Nevada   Casal Institute of Nevada
Sector         Public, 4-year or above  Private for-profit, 2-year
Completions                       2348                          87
Geography                       Nevada                      Nevada

Year                                                                  \
University      Carrington College-Reno Carrington College-Las Vegas
Sector       Private for-profit, 2-year   Private for-profit, 2-year
Completions                         145                          120
Geography                        Nevada                       Nevada

Year                                                                        \
University  Career College of Northern Nevada Brightwood College-Las Vegas
Sector             Private for-profit, 2-year   Private for-profit, 2-year
Completions                               333                          568
Geography                              Nevada                       Nevada

Year                                               \
University            Advanced Training Institute
Sector       Private for-profit, less-than 2-year
Completions                                   218
Geography                                  Nevada

Year
University       Academy of Hair Design-Las Vegas
Sector       Private for-profit, less-than 2-year
Completions                                   110
Geography                                  Nevada

[3 rows x 207 columns]

In [501]:
df_csv.groupby(['University','Year']).describe().transpose()

University        Academy of Hair Design-Las Vegas                             \
Year                                          2012  2013   2014   2015   2016
Completions count                              1.0   1.0    1.0    1.0    1.0
            mean                             110.0  84.0  256.0  180.0  124.0
            std                                NaN   NaN    NaN    NaN    NaN
            min                              110.0  84.0  256.0  180.0  124.0
            25%                              110.0  84.0  256.0  180.0  124.0
            50%                              110.0  84.0  256.0  180.0  124.0
            75%                              110.0  84.0  256.0  180.0  124.0
            max                              110.0  84.0  256.0  180.0  124.0

University        Advanced Training Institute                              \
Year                                     2012   2013   2014   2015   2016
Completions count                         1.0    1.0    1.0    1.0    1.0
            mean                        218.0  157.0  147.0  266.0  372.0
            std                           NaN    NaN    NaN    NaN    NaN
            min                         218.0  157.0  147.0  266.0  372.0
            25%                         218.0  157.0  147.0  266.0  372.0
            50%                         218.0  157.0  147.0  266.0  372.0
            75%                         218.0  157.0  147.0  266.0  372.0
            max                         218.0  157.0  147.0  266.0  372.0

University         ... Utah College of Massage Therapy-Vegas                \
Year               ...                                  2013   2014   2015
Completions count  ...                                   1.0    1.0    1.0
            mean   ...                                 372.0  290.0  316.0
            std    ...                                   NaN    NaN    NaN
            min    ...                                 372.0  290.0  316.0
            25%    ...                                 372.0  290.0  316.0
            50%    ...                                 372.0  290.0  316.0
            75%    ...                                 372.0  290.0  316.0
            max    ...                                 372.0  290.0  316.0

University               Western Nevada College                              \
Year                2016                   2012   2013   2014   2015   2016
Completions count    1.0                    1.0    1.0    1.0    1.0    1.0
            mean   240.0                  495.0  522.0  842.0  925.0  960.0
            std      NaN                    NaN    NaN    NaN    NaN    NaN
            min    240.0                  495.0  522.0  842.0  925.0  960.0
            25%    240.0                  495.0  522.0  842.0  925.0  960.0
            50%    240.0                  495.0  522.0  842.0  925.0  960.0
            75%    240.0                  495.0  522.0  842.0  925.0  960.0
            max    240.0                  495.0  522.0  842.0  925.0  960.0

University        Wongu University of Oriental Medicine
Year                                               2016
Completions count                                   1.0
            mean                                    0.0
            std                                     NaN
            min                                     0.0
            25%                                     0.0
            50%                                     0.0
            75%                                     0.0
            max                                     0.0

[8 rows x 207 columns]

In [502]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [503]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [504]:
df_one['k1'].unique()

array(['A', 'B', 'C'], dtype=object)

In [505]:
df_one['k1'].nunique()

3

In [506]:
df_one['col2'].value_counts()

col2
WA    2
NY    1
CA    1
AK    1
NV    1
Name: count, dtype: int64

In [507]:
df_one['k1'].drop_duplicates()

0    A
2    B
4    C
Name: k1, dtype: object

In [508]:
df_one["col3"] = df_one['col1'] * 2

In [509]:
df_one

  k1  col1 col2  col3
0  A   100   NY   200
1  A   200   CA   400
2  B   300   WA   600
3  B   300   WA   600
4  C   400   AK   800
5  C   500   NV  1000

In [510]:
def first_letter(str):
    return str[0]

In [511]:
df_one['first letter of col1'] = df_one['col2'].apply(first_letter)

In [512]:
df_one

  k1  col1 col2  col3 first letter of col1
0  A   100   NY   200                    N
1  A   200   CA   400                    C
2  B   300   WA   600                    W
3  B   300   WA   600                    W
4  C   400   AK   800                    A
5  C   500   NV  1000                    N

In [513]:
df

             W     E   R   T  new columns
States
Bastam     0.0 -97.0  86 -90          -18
Shahrood   0.0  17.0 -63  42          -26
Bonab      0.0 -40.0  99  37          -11
Tabriz   -77.0 -40.0   3  47          -17

In [557]:
def complex_letter(str):
    if str == 'W':
        return "washington dc"
    else:
        return "unknown"

In [558]:
df_one['first letter of col1'].apply(complex_letter)

0          unknown
1          unknown
2    washington dc
3    washington dc
4          unknown
5          unknown
Name: first letter of col1, dtype: object

In [568]:
df_one['complex letter of col1'] = df_one['first letter of col1'].apply(complex_letter)

In [569]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,1
1,A,200,CA,400,C,unknown,NaN
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,NaN
4,C,400,AK,800,A,unknown,NaN
5,C,500,NV,1000,N,unknown,NaN

In [570]:
df_one['complex letter of col1'].drop_duplicates()

0          unknown
2    washington dc
Name: complex letter of col1, dtype: object

In [584]:
df_one['drop_duplicates'] = df_one['complex letter of col1'].drop_duplicates()

In [585]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,unknown
1,A,200,CA,400,C,unknown,NaN
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,NaN
4,C,400,AK,800,A,unknown,NaN
5,C,500,NV,1000,N,unknown,NaN

In [586]:
my_map = {np.nan:0,'washington dc' : 'washington dc','unknown': 1}

In [587]:
df_one['drop_duplicates'] = df_one['drop_duplicates'].map(my_map)

In [588]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,1
1,A,200,CA,400,C,unknown,0
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,0
4,C,400,AK,800,A,unknown,0
5,C,500,NV,1000,N,unknown,0

In [590]:
df

             W     E   R   T  new columns
States
Bastam     0.0 -97.0  86 -90          -18
Shahrood   0.0  17.0 -63  42          -26
Bonab      0.0 -40.0  99  37          -11
Tabriz   -77.0 -40.0   3  47          -17

In [600]:
pd.concat([df_one,df],axis=1)

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates,W,E,R,T,new columns
0,A,100.0,NY,200.0,N,unknown,1,NaN,NaN,NaN,NaN,NaN
1,A,200.0,CA,400.0,C,unknown,0,NaN,NaN,NaN,NaN,NaN
2,B,300.0,WA,600.0,W,washington dc,washington dc,NaN,NaN,NaN,NaN,NaN
3,B,300.0,WA,600.0,W,washington dc,0,NaN,NaN,NaN,NaN,NaN
4,C,400.0,AK,800.0,A,unknown,0,NaN,NaN,NaN,NaN,NaN
5,C,500.0,NV,1000.0,N,unknown,0,NaN,NaN,NaN,NaN,NaN
Bastam,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,-97.0,86.0,-90.0,-18.0
Shahrood,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,17.0,-63.0,42.0,-26.0
Bonab,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,-40.0,99.0,37.0,-11.0
Tabriz,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-77.0,-40.0,3.0,47.0,-17.0

In [602]:
df.max()

W               0.0
E              17.0
R              99.0
T              47.0
new columns   -11.0
dtype: float64

In [604]:
# show index of max data in column
df.idxmax()

W                Bastam
E              Shahrood
R                 Bonab
T                Tabriz
new columns       Bonab
dtype: object

In [616]:
df_one['col3'].max()

1000

In [619]:
df_one['col3'].idxmax()

5

In [621]:
df_one

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
0,A,100,NY,200,N,unknown,1
1,A,200,CA,400,C,unknown,0
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,0
4,C,400,AK,800,A,unknown,0
5,C,500,NV,1000,N,unknown,0

In [626]:
df_one.sort_values('col2',ascending=False)

,k1,col1,col2,col3,first letter of col1,complex letter of col1,drop_duplicates
2,B,300,WA,600,W,washington dc,washington dc
3,B,300,WA,600,W,washington dc,0
0,A,100,NY,200,N,unknown,1
5,C,500,NV,1000,N,unknown,0
1,A,200,CA,400,C,unknown,0
4,C,400,AK,800,A,unknown,0

In [631]:
df_one.columns

Index(['k1', 'col1', 'col2', 'col3', 'first letter of col1',
       'complex letter of col1', 'drop_duplicates'],
      dtype='object')

In [633]:
df_one.columns = ['c0','c1','c2','c3','c4','c5','c6']

In [635]:
df_one

  c0   c1  c2    c3 c4             c5             c6
0  A  100  NY   200  N        unknown              1
1  A  200  CA   400  C        unknown              0
2  B  300  WA   600  W  washington dc  washington dc
3  B  300  WA   600  W  washington dc              0
4  C  400  AK   800  A        unknown              0
5  C  500  NV  1000  N        unknown              0

In [637]:
df_one['c2']

0    NY
1    CA
2    WA
3    WA
4    AK
5    NV
Name: c2, dtype: object

In [639]:
pd.get_dummies(df_one['c2'])

      AK     CA     NV     NY     WA
0  False  False  False   True  False
1  False   True  False  False  False
2  False  False  False  False   True
3  False  False  False  False   True
4   True  False  False  False  False
5  False  False   True  False  False

In [650]:
pd.get_dummies(df['R'])

            -63     3      86     99
States
Bastam    False  False   True  False
Shahrood   True  False  False  False
Bonab     False  False  False   True
Tabriz    False   True  False  False

In [651]:
pwd

'D:\\py practice\\Exercise Notebooks'

In [652]:
ls

 Volume in drive D is Data
 Volume Serial Number is B4EF-B54C

 Directory of D:\py practice\Exercise Notebooks

02/01/2024  05:57 PM    <DIR>          .
02/01/2024  05:57 PM    <DIR>          ..
01/29/2024  07:17 PM    <DIR>          .ipynb_checkpoints
02/01/2024  01:44 PM    <DIR>          Data
01/26/2024  06:10 PM            39,195 Loading_The_MNIST_Dataset.ipynb
01/29/2024  03:28 AM            22,868 NumPy_Exercises_From_Udemy_Course.ipynb
01/29/2024  10:16 PM            22,117 Playing_With_Numpy_Library.ipynb
02/01/2024  05:57 PM           157,287 Playing_With_Pandas_Library.ipynb
               4 File(s)        241,467 bytes
               4 Dir(s)  158,256,087,040 bytes free

In [656]:
df

             W     E   R   T  new columns
States
Bastam     0.0 -97.0  86 -90          -18
Shahrood   0.0  17.0 -63  42          -26
Bonab      0.0 -40.0  99  37          -11
Tabriz   -77.0 -40.0   3  47          -17

In [661]:
df.to_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFrame.csv',index=False)

In [662]:
df_read = pd.read_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFrame.csv')

In [663]:
df_read

      W     E   R   T  new columns
0   0.0 -97.0  86 -90          -18
1   0.0  17.0 -63  42          -26
2   0.0 -40.0  99  37          -11
3 -77.0 -40.0   3  47          -17

In [665]:
df.to_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFramewithindex.csv')

In [668]:
df_read_index = pd.read_csv('\\py practice\\Exercise Notebooks\\Data\\outputfromDataFramewithindex.csv')

In [670]:
df_read_index

     States     W     E   R   T  new columns
0    Bastam   0.0 -97.0  86 -90          -18
1  Shahrood   0.0  17.0 -63  42          -26
2     Bonab   0.0 -40.0  99  37          -11
3    Tabriz -77.0 -40.0   3  47          -17

In [672]:
tables = pd.read_html('https://shahroodut.ac.ir/fa/schools/index.php?id=S001&index=1000')

In [674]:
type(tables)

list

In [675]:
tables

[                                                    Google Scholar  \
                      /
 0                                      NaN
 1               -                 NaN
 2                                87
 3                                      47
 4                                          90
 5                                          45
 6                                        87
 7                                     316
 8                                           1144
 9                                    775
 10                                     1233
 11                                       3578
 12                   /

                                    Scopus                                  \
     h-index  i10-index      h-index
 0       NaN        NaN      NaN       NaN      NaN           NaN      NaN
 1       NaN        NaN      NaN       NaN      NaN           NaN      NaN
 2         4          3        5        60        4            14       14
 3         4          2        0        25        3             7        7
 4         5          4        2        64        4             9        8
 5         5          1        0        25        4             7        5
 6         6          1        6        51        5             8        4
 7        10         10       18         0        0             0        0
 8        13         16       10       649       11            35       46
 9        14         20        0       483       11            44       51
 10       17         25        0       459       12            52       46
 11       30         90       14      1717       21           168      139
 12  h-index  i10-index      h-index

    Unnamed: 11_level_0
    Unnamed: 11_level_1
 0                  1.0
 1                  2.0
 2                  2.0
 3                  2.0
 4                  2.0
 5                  2.0
 6                  2.0
 7                  3.0
 8                  3.0
 9                  3.0
 10                 2.0
 11                 4.0
 12                 NaN  ]

In [676]:
type(tables[0])

pandas.core.frame.DataFrame

In [679]:
tables[0]

                                                    Google Scholar  \
                     /
0                                      NaN
1               -                 NaN
2                                87
3                                      47
4                                          90
5                                          45
6                                        87
7                                     316
8                                           1144
9                                    775
10                                     1233
11                                       3578
12                   /

                                   Scopus                                  \
    h-index  i10-index      h-index
0       NaN        NaN      NaN       NaN      NaN           NaN      NaN
1       NaN        NaN      NaN       NaN      NaN           NaN      NaN
2         4          3        5        60        4            14       14
3         4          2        0        25        3             7        7
4         5          4        2        64        4             9        8
5         5          1        0        25        4             7        5
6         6          1        6        51        5             8        4
7        10         10       18         0        0             0        0
8        13         16       10       649       11            35       46
9        14         20        0       483       11            44       51
10       17         25        0       459       12            52       46
11       30         90       14      1717       21           168      139
12  h-index  i10-index      h-index

   Unnamed: 11_level_0
   Unnamed: 11_level_1
0                  1.0
1                  2.0
2                  2.0
3                  2.0
4                  2.0
5                  2.0
6                  2.0
7                  3.0
8                  3.0
9                  3.0
10                 2.0
11                 4.0
12                 NaN

In [717]:
tables[0].sort_index(ascending=False).transpose().drop_duplicates()

                                                                       12  \

                                  /                   /

Google Scholar
                                  h-index                         h-index
                                  i10-index                     i10-index

Scopus
                                  h-index                         h-index


Unnamed: 11_level_0               Unnamed: 11_level_1                 NaN
Shahrood University Of Technology                                      13

                                                                  11  \

                                  /

Google Scholar                                          3578
                                  h-index                         30
                                  i10-index                       90
                                                           14
Scopus                                                  1717
                                  h-index                         21
                                                      168
                                                          139
Unnamed: 11_level_0               Unnamed: 11_level_1            4.0
Shahrood University Of Technology                                 12

                                                                 10  \

                                  /

Google Scholar                                         1233
                                  h-index                        17
                                  i10-index                      25
                                                           0
Scopus                                                  459
                                  h-index                        12
                                                      52
                                                          46
Unnamed: 11_level_0               Unnamed: 11_level_1           2.0
Shahrood University Of Technology                                11

                                                                       9   \

                                  /

Google Scholar                                                775
                                  h-index                              14
                                  i10-index                            20
                                                                 0
Scopus                                                        483
                                  h-index                              11
                                                            44
                                                                51
Unnamed: 11_level_0               Unnamed: 11_level_1                 3.0
Shahrood University Of Technology                                      10

                                                               8   \

                                  /

Google Scholar                                       1144
                                  h-index                      13
                                  i10-index                    16
                                                        10
Scopus                                                649
                                  h-index                      11
                                                    35
                                                        46
Unnamed: 11_level_0               Unnamed: 11_level_1         3.0
Shahrood University Of Technology                               9

                                                                      7   \

                                  /

Google Scholar                                               316
                                  h-index                             10
                                  i10-index                           10
                                                               18
Scopus                                                         0
                                  h-index                              0
                                                            0
                                                                0
Unnamed: 11_level_0               Unnamed: 11_level_1                3.0
Shahrood University Of Technology                                      8

                                                                    6   \

                                  /

Google Scholar                                              87
                                  h-index                            6
                                  i10-index                          1
                                                              6
Scopus                                                      51
                                  h-index                            5
                                                          8
                                                              4
Unnamed: 11_level_0               Unnamed: 11_level_1              2.0
Shahrood University Of Technology                                    7

                                                                5   \

                                  /

Google Scholar                                          45
                                  h-index                        5
                                  i10-index                      1
                                                          0
Scopus                                                  25
                                  h-index                        4
                                                      7
                                                          5
Unnamed: 11_level_0               Unnamed: 11_level_1          2.0
Shahrood University Of Technology                                6

                                                                4   \

                                  /

Google Scholar                                          90
                                  h-index                        5
                                  i10-index                      4
                                                          2
Scopus                                                  64
                                  h-index                        4
                                                      9
                                                          8
Unnamed: 11_level_0               Unnamed: 11_level_1          2.0
Shahrood University Of Technology                                5

                                                                     3   \

                                  /

Google Scholar                                               47
                                  h-index                             4
                                  i10-index                           2
                                                               0
Scopus                                                       25
                                  h-index                             3
                                                           7
                                                               7
Unnamed: 11_level_0               Unnamed: 11_level_1               2.0
Shahrood University Of Technology                                     4

                                                                           2   \

                                  /

Google Scholar                                                     87
                                  h-index                                   4
                                  i10-index                                 3
                                                                     5
Scopus                                                             60
                                  h-index                                   4
                                                                14
                                                                    14
Unnamed: 11_level_0               Unnamed: 11_level_1                     2.0
Shahrood University Of Technology                                           3

                                                                          1   \

                                  /            -

Google Scholar                                                   NaN
                                  h-index                                NaN
                                  i10-index                              NaN
                                                                  NaN
Scopus                                                           NaN
                                  h-index                                NaN
                                                              NaN
                                                                  NaN
Unnamed: 11_level_0               Unnamed: 11_level_1                    2.0
Shahrood University Of Technology                                          2

                                                                        0

                                  /

Google Scholar                                                 NaN
                                  h-index                              NaN
                                  i10-index                            NaN
                                                                NaN
Scopus                                                         NaN
                                  h-index                              NaN
                                                            NaN
                                                                NaN
Unnamed: 11_level_0               Unnamed: 11_level_1                  1.0
Shahrood University Of Technology                                        1

In [760]:
df_uni = tables[0]

In [773]:
df_uni["Shahrood University Of Technology"] = np.arange(12,-1,-1)

In [774]:
df_uni = df_uni.set_index('Shahrood University Of Technology').sort_index()

In [775]:
df_uni

                                                                         \
                                                    /
Shahrood University Of Technology
0                                                   /
1
2
3
4
5
6
7
8
9
10
11                                             -
12

                                             Google Scholar           \
                                             h-index
Shahrood University Of Technology
0                                            h-index
1                                                 3578       30
2                                              1233       17
3                                                775       14
4                                               1144       13
5                                                316       10
6                                                87        6
7                                                45        5
8                                                90        5
9                                                47        4
10                                               87        4
11                                              NaN      NaN
12                                                  NaN      NaN

                                                         Scopus           \
                                   i10-index      h-index
Shahrood University Of Technology
0                                  i10-index      h-index
1                                         90       14      1717       21
2                                         25        0       459       12
3                                         20        0       483       11
4                                         16       10       649       11
5                                         10       18         0        0
6                                          1        6        51        5
7                                          1        0        25        4
8                                          4        2        64        4
9                                          2        0        25        3
10                                         3        5        60        4
11                                       NaN      NaN       NaN      NaN
12                                       NaN      NaN       NaN      NaN

                                                         Unnamed: 11_level_0
                                       Unnamed: 11_level_1
Shahrood University Of Technology
0                                                      NaN
1                                           168      139                 4.0
2                                            52       46                 2.0
3                                            44       51                 3.0
4                                            35       46                 3.0
5                                             0        0                 3.0
6                                             8        4                 2.0
7                                             7        5                 2.0
8                                             9        8                 2.0
9                                             7        7                 2.0
10                                           14       14                 2.0
11                                          NaN      NaN                 2.0
12                                          NaN      NaN                 1.0